In [1]:
import sqlite3

In [2]:
import pandas as pd
import os

Q1

In [3]:
maBase="cinema.db"

In [4]:
def AccederBD(maBase):
    conn=sqlite3.connect(maBase)
    curseur=conn.cursor()
    return conn,curseur

In [5]:
AccederBD(maBase)

(<sqlite3.Connection at 0x7b4f40de96c0>, <sqlite3.Cursor at 0x7b4f40e2e540>)

Q2

In [6]:
def CreerTable1(c):
    c.execute("""
    CREATE TABLE film (
        idfilm INTEGER PRIMARY KEY,
        titre TEXT,
        realisateur TEXT,
        annee integer
    )
""")

In [41]:
conn,curseur=AccederBD(maBase)

In [9]:
CreerTable1(curseur)

In [30]:
films = [
    (1, 'Zootopia', 'disney',2025),
    (2, 'Chainsawman','mappa',2025),
    (3, 'frakenstein','netflix',2025),
    (4, 'openheimer', 'warner',2023),
    (5, 'Barbie',  'disney',2023),
    (6, 'ironman', 'marvel',2024),
    (7, 'Avengers',  'marvel', 2022)
]
conn.executemany("INSERT INTO film(idfilm, titre, realisateur,annee) VALUES (?,?,?,?)", films)
conn.commit()

In [44]:
curseur.execute("SELECT * FROM film")
for ligne in curseur.fetchall():
    print(ligne)

(1, 'Zootopia', 'disney', 2025)
(2, 'Chainsawman', 'mappa', 2025)
(3, 'frakenstein', 'netflix', 2025)
(4, 'openheimer', 'warner', 2023)
(5, 'Barbie', 'disney', 2023)
(6, 'ironman', 'marvel', 2024)
(7, 'Avengers', 'marvel', 2022)

In [42]:
curseur.execute("select * from film")
for ligne in curseur.fetchall():
    print(ligne)

(1, 'Zootopia', 'disney', 2025)
(2, 'Chainsawman', 'mappa', 2025)
(3, 'frakenstein', 'netflix', 2025)
(4, 'openheimer', 'warner', 2023)
(5, 'Barbie', 'disney', 2023)
(6, 'ironman', 'marvel', 2024)
(7, 'Avengers', 'marvel', 2022)

Q3

In [10]:
def CreerTable2(c):
    c.execute("""
    CREATE TABLE acteur (
        idActeur INTEGER PRIMARY KEY,
        nom TEXT,
        prenom TEXT
    )
""")

In [11]:
CreerTable2(curseur)

Q4

In [12]:
def CreerTable3(c):
  c.execute("""
    CREATE TABLE filmographie (
      idActeur integer,
      idfilm integer,
      role text,
      salaire integer,
      FOREIGN KEY (idActeur) REFERENCES acteur(idActeur),
      FOREIGN KEY (idfilm) REFERENCES film(idfilm)

    )
""")

In [13]:
CreerTable3(curseur)

Q5

In [14]:
def rech_personne(nom, prenom):
 conn.execute("""
   select * from acteur where nom = ? and prenom = ?
   """, (nom, prenom))

Q6

In [15]:
def insert_acteur(c,id,nom, prenom):
    c.execute("""
    INSERT INTO acteur (idActeur,nom,prenom)
    VALUES (?,?,?)
    """,(id,nom,prenom))
    conn.commit()

Q7

In [38]:
def affiche_table(c,nomTable):
  c.execute("SELECT * FROM {nomTable}")
  for ligne in c.fetchall():
    print(ligne)

Q8

In [17]:
def affiche_film(c,id):
  c.execute("SELECT * FROM film WHERE idfilm = ?",(id,))
  for ligne in c.fetchall():
    print(ligne)

Q9

In [18]:
def supr_film(c,id):
  c.execute("DELETE FROM film WHERE idfilm = ?",(id,))
  conn.commit()

Q10

In [19]:
def modif_FILMOGRAPHIE(c,id1,id2,val):
  c.execute("UPDATE filmographie SET salaire= ? where idActeur = ? and idfilm = ?",(val,id1,id2))
  conn.commit()

Q11

In [20]:
def Nbr_acteurs(c,nomFilm):
  c.execute("SELECT COUNT(idActeur) FROM filmographie WHERE idfilm = (SELECT idfilm FROM film WHERE titre = ?)",(nomFilm,))
  for ligne in c.fetchall():
    print(ligne)

Q12

In [21]:
def ActeursSansFilms(c):
  c.execute("SELECT nom, prenom FROM acteur WHERE idActeur NOT IN (SELECT idActeur FROM filmographie)")
  for ligne in c.fetchall():
    print(ligne)

Q13

In [27]:
def ActeursDebutants(c):
  c.execute("SELECT a.nom, a.prenom, avg(f.salaire) as moyenne_salaire FROM acteur a join filmographie f on f.idActeur=a.idActeur WHERE idActeur IN (SELECT idActeur FROM filmographie) group by a.idActeur ")
  for ligne in c.fetchall():
    print(ligne)

Q14

In [22]:
def ActeursMemeSalaire(c):
  c.execute("SELECT distinct a1.nom,a1.prenom, a2.nom, a2.prenom FROM acteur a1, acteur a2 WHERE a1.idActeur <> a2.idActeur AND a1.salaire = a2.salaire")
  for ligne in c.fetchall():
    print(ligne)

Q15

In [25]:
def SalaireDollarToDirham(c):
  c.execute("SELECT a.nom, a.prenom, f.salaire*10 as salaire_dirham FROM acteur a join filmographie f on f.idActeur=a.idActeur")
  for ligne in c.fetchall():
    print(ligne)

Q16

In [ ]:
def ValiderTrans(c):
  c.commit()

Q17

In [26]:
def TableToFile(Fich,c,nomTable):
  c.execute("SELECT * FROM "+nomTable)
  df = pd.DataFrame(c.fetchall())
  df.to_csv(Fich, index=False)

Q18

In [28]:
def FileToTable(Fich,c,nomTable):
  df = pd.read_csv(Fich)
  df.to_sql(nomTable, conn, if_exists='replace', index=False)

Q19

In [29]:
def FermerConnex(c):
  conn.close()
  print("connexion ferm√©.")

In [ ]:
actors = [
    (1, 'jake', 'jilenhal'),
    (2, 'julia','robert'),
    (3, 'jacob','eldorado'),
    (4, 'cilian', 'murphy'),
    (5, 'marget',  'robert'),
    (6, 'downey', 'robert'),
    (7, 'chris',  'hemsphort')
]

curseur.executemany("INSERT INTO acteur(idActeur, prenom, nom) VALUES (?,?,?)", actors)
conn.commit()